The heart of pandas is just the two primary data structures on which all transactions, which are generally 
made during the analysis of data, are centralized:
•	 Series
•	 DataFrame

# Introduction to pandas Data Structures

In [6]:
import numpy as np
import pandas as pd 

# Declaring a Series
s = pd.Series([1,3,2,-2])
s

0    1
1    3
2    2
3   -2
dtype: int64

In [5]:
s = pd.Series([1,3,4,2,4], index=['a','b','c','d','e'])
s

a    1
b    3
c    4
d    2
e    4
dtype: int64

In [6]:
s.values

array([1, 3, 4, 2, 4], dtype=int64)

In [7]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
# Selecting the Internal Elements
s[2]

4

In [10]:
s['b']

3

In [11]:
s[0:2]

a    1
b    3
dtype: int64

In [12]:
s[['b','c']]

b    3
c    4
dtype: int64

Assigning Values to the Elements

In [14]:
s[1] = 0
s

a    1
b    0
c    4
d    2
e    4
dtype: int64

In [15]:
s['b'] = 1
s

a    1
b    1
c    4
d    2
e    4
dtype: int64

Defining Series from NumPy Arrays and Other Series

In [27]:
arr = np.array([1,3,4,2])
arr

array([1, 3, 4, 2])

In [29]:
s3 = pd.Series(arr)
s3

0    1
1    3
2    4
3    2
dtype: int32

In [30]:
s4 = pd.Series(s)
s4

a    1
b    1
c    4
d    2
e    4
dtype: int64

In [32]:
arr[2] = -1
arr

array([ 1,  3, -1,  2])

Filtering Values

In [37]:
s4[s4 > 8]

Series([], dtype: int64)

Operations and Mathematical Functions

In [39]:
s / 2

a    0.5
b    0.5
c    2.0
d    1.0
e    2.0
dtype: float64

In [40]:
np.log(s)

a    0.000000
b    0.000000
c    1.386294
d    0.693147
e    1.386294
dtype: float64

Evaluating Values

In [41]:
serd = pd.Series([1,0,2,1,2,3], index=['white','white','blue','green','green','yellow']) # duplicate value
serd

white     1
white     0
blue      2
green     1
green     2
yellow    3
dtype: int64

In [42]:
serd.unique()

array([1, 0, 2, 3], dtype=int64)

In [44]:
serd.value_counts()

1    2
2    2
0    1
3    1
dtype: int64

In [45]:
serd.isin([0,3])

white     False
white      True
blue      False
green     False
green     False
yellow     True
dtype: bool

In [46]:
serd[serd.isin([0,3])]

white     0
yellow    3
dtype: int64

NaN Values

In [47]:
s2 = pd.Series([5,-3,np.NaN,14])
s2

0     5.0
1    -3.0
2     NaN
3    14.0
dtype: float64

In [48]:
s2.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [49]:
s2.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [50]:
s2[s2.notnull()]

0     5.0
1    -3.0
3    14.0
dtype: float64

In [51]:
s2[s2.isnull()]

2   NaN
dtype: float64

SyntaxError: invalid syntax (1592236839.py, line 1)

Series as Dictionaries

In [53]:
mydict = {'red': 2000, 'blue': 1000, 'yellow': 500, 'orange': 1000}
mydict

{'red': 2000, 'blue': 1000, 'yellow': 500, 'orange': 1000}

In [54]:
myseries = pd.Series(mydict)
myseries

red       2000
blue      1000
yellow     500
orange    1000
dtype: int64

Operations between Series

In [55]:
mydict2 = {'red':400,'yellow':1000,'black':700}
myseries2 = pd.Series(mydict2)
myseries - myseries2

black        NaN
blue         NaN
orange       NaN
red       1600.0
yellow    -500.0
dtype: float64

The DataFrame
: The DataFrame is a tabular data structure very similar to the Spreadsheet (the most familiar are Excel 
spreadsheets)

 DataFrame may also be understood as a dict of Series

Defining a DataFrame

In [3]:
data = {'color' : ['blue','green','yellow','red','white'],
        'object' : ['ball','pen','pencil','paper','mug'],
        'price' : [1.2,1.0,0.6,0.9,1.7]}

In [4]:
data

{'color': ['blue', 'green', 'yellow', 'red', 'white'],
 'object': ['ball', 'pen', 'pencil', 'paper', 'mug'],
 'price': [1.2, 1.0, 0.6, 0.9, 1.7]}

In [7]:
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [61]:
frame2 = pd.DataFrame(data, columns=['object','price'])
frame2

   object  price
0    ball    1.2
1     pen    1.0
2  pencil    0.6
3   paper    0.9
4     mug    1.7

In [62]:
frame2 = pd.DataFrame(data, index=['one','two','three','four','five'])
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [63]:
>>> frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),
                          index=['red','blue','yellow','white'], 
                          columns=['ball','pen','pencil','paper'])

In [64]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

Selecting Elements

In [65]:
frame.columns

Index(['color', 'object', 'price'], dtype='object')

In [66]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
frame.values

array([['blue', 'ball', 1.2],
       ['green', 'pen', 1.0],
       ['yellow', 'pencil', 0.6],
       ['red', 'paper', 0.9],
       ['white', 'mug', 1.7]], dtype=object)

In [68]:
frame['price']

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [70]:
frame.price # use the column name as an attribute of the instance of the DataFrame

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [72]:
frame.index[2]

2

In [73]:
frame[0:1]

  color object  price
0  blue   ball    1.2

In [74]:
frame[1:3]

    color  object  price
1   green     pen    1.0
2  yellow  pencil    0.6

In [76]:
frame['object'][3]

'paper'

Assigning Values

In [77]:
frame.index.name = 'id' ;  frame.index.name = 'item'

In [78]:
frame

       color  object  price
item
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    0.6
3        red   paper    0.9
4      white     mug    1.7

In [80]:
frame['new'] = 12
frame

       color  object  price  new
item
0       blue    ball    1.2   12
1      green     pen    1.0   12
2     yellow  pencil    0.6   12
3        red   paper    0.9   12
4      white     mug    1.7   12

In [81]:
frame['new'] = [3.0,1.3,2.2,0.8,1.1]
frame

       color  object  price  new
item
0       blue    ball    1.2  3.0
1      green     pen    1.0  1.3
2     yellow  pencil    0.6  2.2
3        red   paper    0.9  0.8
4      white     mug    1.7  1.1

In [82]:
ser = pd.Series(np.arange(5))

In [83]:
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [84]:
frame['new'] =ser

In [85]:
frame

       color  object  price  new
item
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    0.6    2
3        red   paper    0.9    3
4      white     mug    1.7    4

In [86]:
frame['price'][2] = 3.3
frame

C:\Users\Ibrahim\AppData\Local\Temp\ipykernel_21252\2690994415.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame['price'][2] = 3.3

       color  object  price  new
item
0       blue    ball    1.2    0
1      green     pen    1.0    1
2     yellow  pencil    3.3    2
3        red   paper    0.9    3
4      white     mug    1.7    4

Membership of a Value

In [88]:
frame.isin([1.0, 'pen'])

      color  object  price    new
item
0     False   False  False  False
1     False    True   True   True
2     False   False  False  False
3     False   False  False  False
4     False   False  False  False

In [97]:
frame[frame.isin([1.0,'pen'])]

     color object  price
item
0      NaN    NaN    NaN
1      NaN    pen    1.0
2      NaN    NaN    NaN
3      NaN    NaN    NaN
4      NaN    NaN    NaN

Deleting a Column

In [98]:
del frame['new']

KeyError: 'new'

In [99]:
frame

       color  object  price
item
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    3.3
3        red   paper    0.9
4      white     mug    1.7

Filtering

In [13]:
frame['price']< 12

0    True
1    True
2    True
3    True
4    True
Name: price, dtype: bool

DataFrame from Nested dict

In [110]:
nestdict = {'red': { 2012: 22, 2013: 33 }, 
            'white': { 2011: 13, 2012: 22, 2013: 16},
            'blue': {2011: 17, 2012: 27, 2013: 18}}

In [111]:
frame2 = pd.DataFrame(nestdict)

In [112]:
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

Transposition of a DataFrame

In [113]:
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

The Index Objects

In [136]:
import pandas as pd 
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

Methods on Index

In [137]:
ser.idxmin()

'blue'

In [138]:
ser.idxmax()

'white'

In [139]:
ser['white']

8

In [140]:
serd.index.is_unique

False

In [141]:
frame.index.is_unique

True

Other Functionalities on Indexes
•	 Reindexing
•	 Dropping
•	 Alignment

Reindexing

In [163]:
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [164]:
ser.reindex(['three','four','five','one'])

three    7.0
four     4.0
five     NaN
one      2.0
dtype: float64

In [167]:
ser3 = pd.Series([1,5,6,3],index=[0,3,5,6])
ser3

0    1
3    5
5    6
6    3
dtype: int64

In [168]:
ser3.reindex(range(6),method='ffill')

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [169]:
ser3.reindex(range(6),method='bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [170]:
frame.reindex(range(5), method='ffill',columns=['colors','price','new','object'])

      colors  price     new  object
item
0       blue    1.2    blue    ball
1      green    1.0   green     pen
2     yellow    3.3  yellow  pencil
3        red    0.9     red   paper
4      white    1.7   white     mug

Dropping

In [173]:
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [174]:
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

In [175]:
ser.drop(['blue','white'])

red       0.0
yellow    2.0
dtype: float64

In [176]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [177]:
frame.drop(['blue','yellow'])

       ball  pen  pencil  paper
red       0    1       2      3
white    12   13      14     15

In [178]:
frame.drop(['pen','pencil'],axis=1)

        ball  paper
red        0      3
blue       4      7
yellow     8     11
white     12     15

Arithmetic and Data Alignment

In [179]:
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])

In [180]:
s1 + s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [181]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index=['red','blue','yellow','white'],
                      columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
                      index=['blue','green','white','yellow'],
                      columns=['mug','pen','ball'])
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [182]:
frame2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [183]:
frame1 + frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

Operations between Data Structures

Flexible Arithmetic Methods

•	 add()
•	 sub()
•	 div()
•	 mul()

In [184]:
frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

Operations between DataFrame and Series

In [185]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [187]:
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])
ser

ball      0
pen       1
pencil    2
paper     3
dtype: int32

In [188]:
frame -ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [189]:
ser['mug'] = 9

In [190]:
ser

ball      0
pen       1
pencil    2
paper     3
mug       9
dtype: int64

In [191]:
frame - ser

        ball  mug  paper  pen  pencil
red        0  NaN      0    0       0
blue       4  NaN      4    4       4
yellow     8  NaN      8    8       8
white     12  NaN     12   12      12

Function Application and Mapping

Functions by Element

In [193]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])

In [194]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [195]:
 np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [196]:
f = lambda x: x.max() - x.min()

>>> def f(x):
... return x.max() - x.min()

In [198]:
frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [200]:
frame.apply(f, axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [201]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [202]:
frame.apply(f)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

Statistics Functions

In [203]:
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [204]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [205]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

Sorting and Ranking

In [207]:
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [209]:
ser.sort_index()

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [210]:
ser.sort_index(ascending=False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [212]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [213]:
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [214]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [227]:
frame.sort_index(axis=1) # try with 0

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [224]:
# frame.sort_index(by=['pen','pencil'])

TypeError: sort_index() got an unexpected keyword argument 'by'

In [228]:
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [229]:
ser.rank(method='first')

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [230]:
ser.rank(ascending=False)

red       2.0
blue      5.0
yellow    4.0
white     1.0
green     3.0
dtype: float64

Correlation and Covariance

In [231]:
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008','2009','2010','2011','2012','2013'])

In [232]:
seq2

2006    3
2007    4
2008    3
2009    4
2010    5
2011    4
2012    3
2013    2
dtype: int64

In [233]:
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008','2009','2010','2011','2012','2013'])

In [234]:
seq

2006    1
2007    2
2008    3
2009    4
2010    4
2011    3
2012    2
2013    1
dtype: int64

In [235]:
seq.corr(seq2)

0.7745966692414835

In [236]:
seq.cov(seq2)

0.8571428571428571

In [238]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
                   index=['red','blue','yellow','white'],
                   columns=['ball','pen','pencil','paper'])
frame2

        ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4

In [239]:
frame2.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [240]:
frame2.cov()

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

In [241]:
frame2.corrwith(ser)

ball     -0.140028
pen      -0.869657
pencil    0.080845
paper     0.595854
dtype: float64

In [242]:
frame2.corrwith(frame)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

Assigning a NaN Value

In [243]:
ser = pd.Series([0,1,2,np.NaN,9], index=['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [244]:
ser['white'] = None
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [245]:
 ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [246]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [247]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
                      index = ['blue','green','red'],
                      columns = ['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [248]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [249]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

Filling in NaN Occurrences

In [250]:
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [251]:
frame3.fillna({'ball':1,'mug':0,'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

Hierarchical Indexing and Leveling

In [253]:
mser = pd.Series(np.random.rand(8),
                 index=[['white','white','white','blue','blue','red','red','red'],
                        ['up','down','right','up','down','up','down','left']])
mser

white  up       0.829007
       down     0.035914
       right    0.584758
blue   up       0.145006
       down     0.602155
red    up       0.017915
       down     0.479027
       left     0.280903
dtype: float64

In [254]:
mser.index

MultiIndex([('white',    'up'),
            ('white',  'down'),
            ('white', 'right'),
            ( 'blue',    'up'),
            ( 'blue',  'down'),
            (  'red',    'up'),
            (  'red',  'down'),
            (  'red',  'left')],
           )

In [255]:
mser['white']

up       0.829007
down     0.035914
right    0.584758
dtype: float64

In [256]:
mser[:,'up']

white    0.829007
blue     0.145006
red      0.017915
dtype: float64

In [257]:
mser['white','up']

0.8290067670963847

In [259]:
mser.unstack()
# converts the Series with hierarchical index in a simple DataFrame, 
# where the second set of indexes is converted into a new set of columns.

           down      left     right        up
blue   0.602155       NaN       NaN  0.145006
red    0.479027  0.280903       NaN  0.017915
white  0.035914       NaN  0.584758  0.829007

In [260]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [261]:
frame.stack() #convert a DataFrame in a Series

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [263]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
                      index=[['white','white','red','red'], ['up','down','up','down']],
                      columns=[['pen','pen','paper','paper'],[1,2,1,2]])
mframe

                 pen               paper
                   1         2         1         2
white up   -0.895580 -0.809988 -0.545334  1.017638
      down  0.505111 -1.075266 -0.105049  1.206807
red   up   -0.335357 -1.334818  1.347247  0.032557
      down  0.149567  0.605758  0.094151 -0.760898

Reordering and Sorting Levels

In [265]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up     -0.895580 -0.809988 -0.545334  1.017638
       down    0.505111 -1.075266 -0.105049  1.206807
red    up     -0.335357 -1.334818  1.347247  0.032557
       down    0.149567  0.605758  0.094151 -0.760898

In [266]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white  -0.895580 -0.809988 -0.545334  1.017638
down   white   0.505111 -1.075266 -0.105049  1.206807
up     red    -0.335357 -1.334818  1.347247  0.032557
down   red     0.149567  0.605758  0.094151 -0.760898

KeyError: '%colors'

In [270]:
mframe.sum(level='colors')

C:\Users\Ibrahim\AppData\Local\Temp\ipykernel_21252\3153633550.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  mframe.sum(level='colors')

objects       pen               paper
id              1         2         1         2
colors
white   -0.390469 -1.885254 -0.650383  2.224445
red     -0.185791 -0.729060  1.441398 -0.728341

In [271]:
mframe.groupby(['colors']).sum()

objects       pen               paper
id              1         2         1         2
colors
red     -0.185791 -0.729060  1.441398 -0.728341
white   -0.390469 -1.885254 -0.650383  2.224445